app/Controllers/Product.php

SELECT `barang`.*, `kategori`.`nama` AS `kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori`=`kategori`.`id`
---
    public function index()
    {
        $barang = $this->barang->select('barang.*, kategori.nama AS kategori')->join('kategori', 'barang.id_kategori=kategori.id')->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        $kategori = $this->kategori->findAll();

INSERT INTO `barang` (`nama`, `harga`, `stok`, `id_kategori`, `gambar`) VALUES ('Sepatu Kuning', '120000', '20', '2', 'product-9_2.jpg')
---
    public function create()
    {
        if($this->request->getPost()){
            $data = $this->request->getPost();
            $gambar = $this->request->getFile('gambar');
            $gambar->move('uploads/');
            $namaGambar = $gambar->getName();

            $this->validation->run($data, 'barang');
            $errors = $this->validation->getErrors();
            if(!$errors){

                $barangModel = new \App\Models\BarangModel();
                $barangentity = new \App\Entities\Barang();
                $data['gambar'] = $namaGambar;
                // $gambar->move('uploads/', $data['gambar']);
                // $filepath = WRITEPATH . 'uploads/' . $gambar->store();
                // $uploadgambar = ['uploaded_fileinfo' => new File($filepath)];
                $barangentity->fill($data);
                $barangModel->save($data);

SELECT *
FROM `barang`
WHERE `id` = '1'
---
    public function edit()
    {
        $id = $this->request->uri->getSegment(3);
        $barang=$this->barang->select('*')->where('id',$id)->findAll();

UPDATE `barang` SET `nama` = 'Sepatu Kuning', `harga` = '120000', `stok` = '20', `gambar` = 'product-9_3.jpg', `id_kategori` = '3'
WHERE `id` = '8'
---
    public function update()
    {
        if($this->request->getPost()){
            $data = $this->request->getPost();
            $gambar = $this->request->getFile('gambar');
            $gambar->move('uploads/');
            $namaGambar = $gambar->getName();
            // dd($data['id']);
            // $barangModel = new \App\Models\BarangModel();
            $db = \Config\Database::connect();
            $builder =  $db->table('barang');
            $builder->select('*')->where('id', $data['id']);
            // dd($builder->get()->getResult());
            $this->validation->run($data, 'barang');
            $errors = $this->validation->getErrors();
            if(!$errors){
                $db = \Config\Database::connect();
                $builder =  $db->table('barang');
                $reqData = [
                    'nama' => $data['nama'],
                    'harga'  => $data['harga'],
                    'stok'  =>$data['stok'],
                    'gambar'  => $namaGambar,
                    'id_kategori'  => $data['id_kategori'],
                ];
                $builder->update($reqData,['id'=>$data['id']]);